# Reset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeIterator..::..Reset Method
ConduitSizeIterator Class See Also
---
Resets the iterator to the initial state.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# See Also
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace